matt-garman/pic10f320-bypass-firmware/bypass_mcu_pic10f320.c
// SPDX-License-Identifier: MIT
// Copyright (c) Matthew Garman


/*****************************************************************************
 * NOTE: this source code makes numerous references to the parent project,
 *       mcu-bypass-firmware:
 *       https://github.com/matt-garman/mcu-bypass-firmware
 *****************************************************************************/


//
// PIC10F320 DIP-8 Pinout
//                                                     +----+
//                                            N/C pin1-|    |-pin8 RA3 (~MCLR/V_PP)
//                                           V_DD pin2-|    |-pin7 V_SS (GND)
// (INT/T0CKI/NCO1/CLC1IN1/CLKR/AN2/~CWG1FLT) RA2 pin3-|    |-pin6 N/C
//(PWM2/CLC1/CWG1B/AN1/CLKIN/ICSPCLK/NCO1CLK) RA1 pin4-|    |-pin5 RA0 (PWM1/CLC1IN0/CWG1A/AN0/ICSPDAT)
//                                                     +----+
//

#include <xc.h> // device SFRs, CLRWDT(), __delay_ms()

#include <assert.h>
#include <stdint.h>


// number of HIGH footswitch pin reads to be considered release-debounced,
// i.e. the "lock-out" period
#define RELEASE_THRESH  (25U)

// number of LOW footswitch pin reads to be considered press-debounced
#define PRESSED_THRESH  (8U)


// PIC10F320 pin map: PORTA/TRISA/LATA bit positions.  The PIC10F320 has four
// GPIO pins: RA0, RA1, RA2 are bidirectional, and RA3 is INPUT-ONLY (it
// shares MCLR/VPP; with MCLRE=OFF it is a plain digital input).  So the
// footswitch (an input) goes on RA3, freeing RA0-RA2 as the three outputs.
//
// footswitch and status LED pins are common across all output variants
#define FOOTSW_PIN      (3U) // RA3 (input-only) + weak pull-up
#define LED_PIN         (0U) // RA0


// RA1/RA2 designation depending on output scheme
#if defined(OUTPUT_CD4053_SIMPLE)
#  define CD4053_PIN      (1U) // RA1
#elif defined(OUTPUT_CD4053_WITH_MUTE)
#  define CD4053_CTL1     (1U) // RA1
#  define CD4053_CTL2     (2U) // RA2
#elif defined(OUTPUT_TQ2_RELAY)
#  define RELAY_RESET_PIN (1U) // RA1
#  define RELAY_SET_PIN   (2U) // RA2
#else
#  error "output scheme not defined: define one of OUTPUT_CD4053_SIMPLE, OUTPUT_CD4053_WITH_MUTE, or OUTPUT_TQ2_RELAY"
#endif



// CD4053-vs-TMUX4053 control-pin drive polarity. See parent project
// src/bypass_output_x4053_polarity.h and/or DESIGN_DOCUMENTATION.adoc for
// details; summary:
//   - CD4053 at 9-18V: MCU at 5V drives a MOSFET inverter -> MCU high -> 4053 sees LOW
//   - TMUX4053 at logic level: MCU drives the control pin directly
// Each OUTPUT_* block below defines its own per-pin hw_*_high()/hw_*_low()
// functions (one pair per control pin) under this same BYPASS_X4053_DIRECT_DRIVE
// #if, rather than a single parametric helper -- see the comment next to the
// CD4053 SIMPLE block for why.




// Bits that must be OUTPUTS (RA0|RA1|RA2).
//
// Macro name ("DDR") is the AVR Classic convention from the parent project;
// we keep the DDR naming here to try to maintain conventions between
// projects.
//
// Macro value is the output-bit set, interpreted by
// the inline TRISA/LATA setup in init(); on PIC: TRISA bit 0 = output
// (hw_configure_output_pins() in the parent project)
//
// All output schemes use RA0..RA2:
//    relay = LED(RA0), RESET(RA1), SET(RA2)
//    mute = LED(RA0), CTL1(RA1), CTL2(RA2)
//    cd4053-simple = LED(RA0), CD4053(RA1), leaving RA2 a spare driven low
// Mask 0x07 for all
#define BYPASS_OUTPUT_DDR_MASK (0x07U) // RA0|RA1|RA2


// HFINTOSC frequency select value for 2 MHz (OSCCONbits.IRCF = 0b100).
// Must agree with _XTAL_FREQ (which is asserted below).
// Referenced both in init() and per-tick runtime sanity in main()
#define HFINTOSC_2MHZ_IRCF (0x04U) // 0b100 = 2 MHz

// WDT postscaler value for the chosen ~256 ms watchdog period.
// Per DS40001585: WDTPS = 0b01000 => 1:8192 on the ~31 kHz LFINTOSC.
// De-rated worst-case is asserted via WDT_MIN_PERIOD_MS below.
// Referenced both in init() and per-tick runtime sanity in main()
#define WDT_WDTPS_256MS (0x08U)

#define TMR2_T2CON_CONFIG (0x05U) // T2CKPS=0b01 (1:4),  TMR2ON=1
#define TMR2_PR2_PERIOD   (124U)  // PR2 = 124 -> 125 counts @ 125 kHz




// Upper bound for values stored in the uint8_t debounce counter, as an
// UNSIGNED constant.  We deliberately do NOT use <stdint.h>'s UINT8_MAX: by C
// integer-promotion rules a uint8_t promotes to (signed) int, so UINT8_MAX
// itself has type int.  Comparing it to our unsigned thresholds is an
// essential-type-category mix (MISRA 10.4), and its expansion (0x7f*2+1) also
// trips MISRA 12.1.  A plain unsigned literal means the same thing and avoids
// both -- see MISRA_COMPLIANCE.md.
//
// Loosely speaking: MISRA-C compliant UINT8_MAX
#define DEBOUNCE_COUNTER_MAX (255U)



// CONFIG (configuration word)
#pragma config FOSC  = INTOSC
#pragma config BOREN = ON
#pragma config WDTE  = ON
#pragma config PWRTE = ON
#pragma config MCLRE = OFF
#pragma config CP    = OFF
#pragma config LVP   = OFF
#pragma config LPBOR = OFF
#pragma config BORV  = HI
#pragma config WRT   = OFF



// static_assert() shim for xc8-cc
//   - XC8 v3.10 supports only C99 (not C11), which does not have
//     static_assert() in <assert.h>
//   - this firmware makes extensive use of static_assert() compile-time
//     checks
//   - so here we alias static_assert() to _Static_assert(), which xc8 does
//     provide
#if !defined(static_assert)
#  define static_assert _Static_assert
#endif

// MCU-neutral threshold invariants -- identical across all shells, so defined
// once here.  Evaluated at file scope (zero runtime cost); a violation fails the
// build of every shell that includes this header.
static_assert(RELEASE_THRESH < DEBOUNCE_COUNTER_MAX, "RELEASE_THRESH >= DEBOUNCE_COUNTER_MAX (i.e. UINT8_MAX)");
static_assert(RELEASE_THRESH > 0U,                   "RELEASE_THRESH <= 0");
static_assert(RELEASE_THRESH > PRESSED_THRESH,       "RELEASE_THRESH <= PRESSED_THRESH");
static_assert(PRESSED_THRESH < DEBOUNCE_COUNTER_MAX, "PRESSED_THRESH >= DEBOUNCE_COUNTER_MAX (i.e. UINT8_MAX)");
static_assert(PRESSED_THRESH > 0U,                   "PRESSED_THRESH <= 0");

// pin-map sanity: the PIC pin map hard-codes PORTA bit positions as literals
// (0U,1U,2U,3U).  Pin them at compile time against the DFP's _PORTA_RAx_POSN
// so a typo in the map or a DFP change can never silently misroute a pin
static_assert(FOOTSW_PIN  == _PORTA_RA3_POSN, "FOOTSW_PIN must be RA3");
static_assert(LED_PIN     == _PORTA_RA0_POSN, "LED_PIN must be RA0");

// _XTAL_FREQ (a build flag, used by the drivers' __delay_ms) must match the
// 2MHz HFINTOSC selected in init(), or the coil/mute pulse widths
// would be wrong.
static_assert(_XTAL_FREQ ==  2000000UL, "_XTAL_FREQ must be 2 MHz (matches OSCCON IRCF)");


// Watchdog safety margin: formalises the hand-calculated budget described in
// init()'s WDTCON comment as a build-time invariant.  The longest stretch between
// two CLRWDT() "pets" is one tick wait plus the longest BLOCKING output actuation
// in a toggling tick (the relay/mute pulse).  That window must stay safely under
// the WDT's worst-case (shortest) period, or a healthy main loop could trip the
// dog.  The per-variant pulse term is asserted next to the existing
// "pulse < RELEASE_THRESH" check in each hw_is_sanity_check_failed().
//   TICK_PERIOD_MS    : the 1ms TMR2 tick (PR2=124 with the 1:4 prescaler on
//                       FOSC/4=500kHz -> 125kHz, so 125 counts = 1ms).
//   WDT_MIN_PERIOD_MS : ~256ms nominal (WDTPS=0x08 = 1:8192 on the ~31kHz
//                       LFINTOSC), de-rated by the datasheet worst-case -37%
//                       (param 31) to a ~160ms floor.
#define TICK_PERIOD_MS    (1U)
#define WDT_MIN_PERIOD_MS (160U)




//////////////////////////////////////////////////////////////////////////////
// TYPES
//////////////////////////////////////////////////////////////////////////////

