matt-garman/pic10f320-bypass-firmware/bypass_mcu_pic10f320.c
// possible high-level states of the debounce/bypass scheme
typedef enum {
    // 1ms footswitch pin sampling, waiting for footswitch to be
    // press-debounced (i.e. footswitch considered open/released in this
    // state)
    PRESS_DEBOUNCE_WAIT = 0,

    // 1ms footswitch pin sampling, footswitch was previously confirmed
    // debounce-pressed, now waiting for footswitch to be release-debounced
    // (i.e. footswitch considered closed/pressed in this state)
    RELEASE_DEBOUNCE_WAIT,
} program_state_t;


// a flag to keep track of the effect/bypass state
typedef enum {
    BYPASS = 0,
    ENGAGED,
} effect_state_t;


// return type of hw_read_footswitch()
typedef enum {
    PIN_STATE_LOW = 0,
    PIN_STATE_HIGH
} pin_state_t;


// wrap up the three global variables that comprise the runtime context of the
// debounce-bypass algorithm
typedef struct {
    program_state_t program_state;
    effect_state_t  effect_state;
    uint8_t         debounce_counter;
} debounce_context_t;





//////////////////////////////////////////////////////////////////////////////
// HARDWARE INTERFACE FUNCTIONS
//////////////////////////////////////////////////////////////////////////////

// LED_PIN high = status LED lit; low = dark.  Outputs are written via LATA.
static void hw_led_pin_set_high(void) { LATA |=  (uint8_t)(1U << LED_PIN); }
static void hw_led_pin_set_low(void)  { LATA &= (uint8_t)~(1U << LED_PIN); }


// sanity-check utility: return non-zero IFF every pin in expected_mask is still
// configured as an output (its TRISA direction bit is still 0).
static uint8_t hw_output_pins_intact(uint8_t const expected_mask) {
    return (0U == (TRISA & expected_mask));
}


// Per-output-pin set-high/set-low functions live in each OUTPUT_* block below
// (one pair per control pin), not as a single hw_pin_set_high/low(pin) helper:
// every call site passes a compile-time-constant pin, but free-tier XC8 does
// not propagate that constant through a function-call boundary, so a
// parametric helper compiles to a real runtime shift loop. Baking the bit into
// each pin's own function lets it collapse to a single bsf/bcf, matching what
// hw_led_pin_set_high/low above already do.





//////////////////////////////////////////////////////////////////////////////
// OUTPUT VARIANT: CD4053 SIMPLE
#if defined(OUTPUT_CD4053_SIMPLE)

// assert critical pin directions hold: LED & CD4053 outputs, footswitch input
static uint8_t hw_is_sanity_check_failed(void) {
    static_assert(CD4053_PIN  == _PORTA_RA1_POSN, "CD4053_PIN must be RA1");

    return (hw_output_pins_intact((1U << LED_PIN) | (1U << CD4053_PIN)) == 0U);
}

// default:
//   CD4053_PIN high -> MOSFET on  -> CD4053 control pin low
//   CD4053_PIN low  -> MOSFET off -> CD4053 control pin high
//
// with BYPASS_X4053_DIRECT_DRIVE defined:
//   CD4053_PIN high -> [direct drive] -> TMUX4053 control pin high
//   CD4053_PIN low  -> [direct drive] -> TMUX4053 control pin low
//
// constant-bit functions, not a parametric hw_pin_set_high/low(pin) helper:
// see the comment below hw_output_pins_intact() for why.
#if defined(BYPASS_X4053_DIRECT_DRIVE) // TMUX4053, direct-drive
static void hw_x4053_ctl_high(void) { LATA |=  (uint8_t)(1U << CD4053_PIN); }
static void hw_x4053_ctl_low(void)  { LATA &= (uint8_t)~(1U << CD4053_PIN); }
#else                                  // CD4053 + MOSFET inverter (default)
static void hw_x4053_ctl_high(void) { LATA &= (uint8_t)~(1U << CD4053_PIN); }
static void hw_x4053_ctl_low(void)  { LATA |=  (uint8_t)(1U << CD4053_PIN); }
#endif

static void hw_set_bypass_state(void) {
    hw_led_pin_set_low(); // dark status LED
    hw_x4053_ctl_high(); // set CD4053 pin high
}

static void hw_set_engaged_state(void) {
    hw_led_pin_set_high(); // light status LED
    hw_x4053_ctl_low();   // set CD4053 pin low
}

//////////////////////////////////////////////////////////////////////////////
// OUTPUT VARIANT: CD4053 WITH MUTING
#elif defined(OUTPUT_CD4053_WITH_MUTE)

// how long to mute the effect before switching between effect/bypass
#  define CD4053_MUTE_DELAY_MS (5U)

static uint8_t hw_is_sanity_check_failed(void) {

    static_assert(CD4053_CTL1 == _PORTA_RA1_POSN, "CD4053_CTL1 must be RA1");
    static_assert(CD4053_CTL2 == _PORTA_RA2_POSN, "CD4053_CTL2 must be RA2");

    static_assert(CD4053_MUTE_DELAY_MS < RELEASE_THRESH,
            "CD4053 mute delay must be shorter than the release-lockout window, "
            "or the re-arm point can be missed during the blocking actuation");

    static_assert((TICK_PERIOD_MS + CD4053_MUTE_DELAY_MS) < WDT_MIN_PERIOD_MS,
            "1ms tick + mute pulse must stay under the worst-case WDT period");

    return (0U == hw_output_pins_intact((1U << LED_PIN) | (1U << CD4053_CTL1) | (1U << CD4053_CTL2)));
}

// wrap this into a function to save firmware space
// direct/inline use of __delay_ms() in the hw_set_xxx_state() calls below
// duplicates code and blows our 256-word flash budget of the PIC10F320;
// wrapping this into a single re-used function saves precious flash space
static void hw_x4053_mute_delay(void) {
    __delay_ms(CD4053_MUTE_DELAY_MS); // busy sleep for pre-switch mute time
}

// constant-bit functions, not a parametric hw_pin_set_high/low(pin) helper:
// see the comment below hw_output_pins_intact() for why.
#if defined(BYPASS_X4053_DIRECT_DRIVE) // TMUX4053, direct-drive
static void hw_x4053_ctl1_high(void) { LATA |=  (uint8_t)(1U << CD4053_CTL1); }
static void hw_x4053_ctl1_low(void)  { LATA &= (uint8_t)~(1U << CD4053_CTL1); }
static void hw_x4053_ctl2_high(void) { LATA |=  (uint8_t)(1U << CD4053_CTL2); }
static void hw_x4053_ctl2_low(void)  { LATA &= (uint8_t)~(1U << CD4053_CTL2); }
#else                                  // CD4053 + MOSFET inverter (default)
static void hw_x4053_ctl1_high(void) { LATA &= (uint8_t)~(1U << CD4053_CTL1); }
static void hw_x4053_ctl1_low(void)  { LATA |=  (uint8_t)(1U << CD4053_CTL1); }
static void hw_x4053_ctl2_high(void) { LATA &= (uint8_t)~(1U << CD4053_CTL2); }
static void hw_x4053_ctl2_low(void)  { LATA |=  (uint8_t)(1U << CD4053_CTL2); }
#endif

// See "Improved Scheme With Muting" in parent project
// DESIGN_DOCUMENTATION.adoc
//
// NOTE: both set_bypass and set_engaged claim a re-assertion of the state
//       from which we're switching.  Note that "re-assertion" is not
//       technically true for the set_bypass function at startup (or after a
//       RESET) - this is because the hardware design intent is to default to
//       bypass state at power-on.  In effect, at power-on, the following
//       happens:
//          - the effect state is bypass due to hardware wiring
//          - the MCU boots, and immediately calls hw_set_bypass_state()
//          - the engaged state is "re-asserted": in this specific case, it
//            actually flips to engaged, then...
//          - immediately flips to bypass
//
static void hw_set_bypass_state(void) {
    hw_x4053_ctl1_low(); // re-assert previous ENGAGED state
    hw_x4053_ctl2_low();

    hw_led_pin_set_low(); // dark status LED

