matt-garman/pic10f320-bypass-firmware/bypass_mcu_pic10f320.c
    hw_x4053_ctl1_high(); // MUTE
    hw_x4053_mute_delay(); // busy sleep for pre-switch mute time

    hw_x4053_ctl2_high(); // un-mute in BYPASS state
}

static void hw_set_engaged_state(void) {
    hw_x4053_ctl1_high(); // re-assert previous BYPASS state
    hw_x4053_ctl2_high();

    hw_led_pin_set_high(); // light status LED

    hw_x4053_ctl2_low(); // MUTE
    hw_x4053_mute_delay(); // busy sleep for pre-switch mute time

    hw_x4053_ctl1_low(); // un-mute in ENGAGED state
}

//////////////////////////////////////////////////////////////////////////////
// OUTPUT VARIANT: TQ2-L2-5V MECHANICAL RELAY
#elif defined(OUTPUT_TQ2_RELAY)

// Panasonic TQ-L2-5V specifies a 4ms minimum current pulse for the set/reset
// coils; multiply by a factor of three for a safety margin
#  define TQ2_L2_5V_PULSE_MS (12U)

static uint8_t hw_is_sanity_check_failed(void) {

    static_assert(TQ2_L2_5V_PULSE_MS < RELEASE_THRESH,
            "relay coil pulse must be shorter than the release-lockout window, "
            "or the re-arm point can be missed during the blocking actuation");

    static_assert((TICK_PERIOD_MS + TQ2_L2_5V_PULSE_MS) < WDT_MIN_PERIOD_MS,
            "1ms tick + relay coil pulse must stay under the worst-case WDT period");

    static_assert(RELAY_RESET_PIN == _PORTA_RA1_POSN, "RELAY_RESET_PIN must be RA1");
    static_assert(RELAY_SET_PIN   == _PORTA_RA2_POSN, "RELAY_SET_PIN must be RA2");

    return (0U == hw_output_pins_intact((1U << LED_PIN) | (1U << RELAY_SET_PIN) | (1U << RELAY_RESET_PIN)));
}

// constant-bit functions, not a parametric hw_pin_set_high/low(pin) helper:
// see the comment below hw_output_pins_intact() for why. No polarity
// indirection needed here (the relay coils are not an x4053 control input).
static void hw_relay_reset_pin_set_high(void) { LATA |=  (uint8_t)(1U << RELAY_RESET_PIN); }
static void hw_relay_reset_pin_set_low(void)  { LATA &= (uint8_t)~(1U << RELAY_RESET_PIN); }
static void hw_relay_set_pin_set_high(void)   { LATA |=  (uint8_t)(1U << RELAY_SET_PIN); }
static void hw_relay_set_pin_set_low(void)    { LATA &= (uint8_t)~(1U << RELAY_SET_PIN); }

// force both coils low
// - it's not strictly necessary to set both low; but we do this as part of
//   the project's overall defense-in-depth/belt-and-suspenders paradigm
// - the intent is to prevent accidentally leaving the relay coil active too
//   long (e.g. programmer mistake)
static void set_relay_coils_low(void) {
    hw_relay_reset_pin_set_low();
    hw_relay_set_pin_set_low();
}

// wrap this into a function to save firmware space
// see notes for hw_x4053_mute_delay() above
static void hw_tq2_pulse_delay(void) {
    __delay_ms(TQ2_L2_5V_PULSE_MS);   // busy sleep for coil pulse time
}

static void hw_set_bypass_state(void) {
    set_relay_coils_low(); // re-assert expected state (both coils should already be low)

    hw_led_pin_set_low(); // dark status LED

    hw_relay_reset_pin_set_high(); // pulse reset coil
    hw_tq2_pulse_delay();          // busy sleep for coil pulse time

    set_relay_coils_low(); // done pulsing, force both coils low
}

static void hw_set_engaged_state(void) {
    set_relay_coils_low(); // re-assert expected state (both coils should already be low)

    hw_led_pin_set_high(); // light status LED

    hw_relay_set_pin_set_high(); // pulse set coil
    hw_tq2_pulse_delay();        // busy sleep for coil pulse time

    set_relay_coils_low(); // done pulsing, force both coils low
}

#else
#  error "output scheme not defined: define one of OUTPUT_CD4053_SIMPLE, OUTPUT_CD4053_WITH_MUTE, or OUTPUT_TQ2_RELAY"
#endif





// infinite-loop function to force a watchdog reset, for critical, unrecoverable
// errors (presumably ultra-rare events: cosmic rays, extreme EMI).  Disables
// interrupts first so nothing can pet the dog.
//
// IMPORTANT: relies on the watchdog being active (WDTE=ON in CONFIG); without
// it this would lock up the MCU.
__attribute__((noreturn)) static void hw_force_wdt_reset(void) {
    INTCONbits.GIE = 0;
    for (;;) { }
}


// read FOOTSW_PIN (RA3) to determine if it's high or low
//   FOOTSW_PIN high = switch open/released
//   FOOTSW_PIN low  = switch closed/pressed
// returns: PIN_STATE_HIGH or PIN_STATE_LOW
static pin_state_t hw_read_footswitch(void) {
    return (0U == (PORTA & (uint8_t)(1U << FOOTSW_PIN))) ?
        PIN_STATE_LOW :
        PIN_STATE_HIGH;
}


// non-zero IFF the footswitch weak pull-up is genuinely active.  The PIC weak
// pull-up has a TWO-part enable: the per-pin WPUA latch AND the global,
// active-low OPTION_REG.nWPUEN.  An SEU/EMI flip of EITHER silently disables the
// pull-up, so both are checked.
//
// The two volatile SFRs are read into locals first so the && combines two plain
// (non-volatile) booleans: this keeps MISRA Rule 13.5 clean (no persistent side
// effect on the right operand of &&), a rule from which the project does not
// deviate.
static uint8_t hw_footswitch_pullup_intact(void) {
    uint8_t pin_latched = (uint8_t)(WPUA & (1U << FOOTSW_PIN));
    uint8_t wpu_global  = (uint8_t)OPTION_REGbits.nWPUEN; // 0 = enabled
    return (0U != pin_latched) && (0U == wpu_global);
}


// non-zero IFF the critical configuration SFRs still hold the values init() set:
// the 2MHz clock select (OSCCON.IRCF), the ~256ms watchdog period
// (WDTCON.WDTPS), the 1ms tick timer (PR2 + T2CON), and the all-digital
// output-pin select (ANSELA bits for RA0..RA2 clear).  An SEU/EMI flip of any of
// these silently breaks timing, or -- for ANSELA -- takes an output pin out of
// digital service (dark LED / dead control pin) while its TRISA direction bit
// still reads "output", which hw_is_sanity_check_failed() cannot see.
//
// A previous iteration of this function read each volatile SFR into a local
// first so the combining "&&" operators have no persistent side effect on
// their right operand so as to not deviate from MISRA Rule 13.5.  However,
// using locals eats into the space of the flash-constrained PIC10F320 part;
// and in practice, using the "&&" operator is not flagged as a MISRA
// violation.  In case this function ever fails MISRA 13.5, we can
// re-introduce the local variables (assuming there is flash space).
static uint8_t hw_critical_sfrs_intact(void) {
    return
        (HFINTOSC_2MHZ_IRCF == OSCCONbits.IRCF) &&
        (WDT_WDTPS_256MS == WDTCONbits.WDTPS) &&
        (TMR2_PR2_PERIOD == PR2) &&
        (TMR2_T2CON_CONFIG == T2CON) &&
        (0U == (uint8_t)(ANSELA & BYPASS_OUTPUT_DDR_MASK));
}



//////////////////////////////////////////////////////////////////////////////
// PROGRAM GLOBAL: overall debounce context
//////////////////////////////////////////////////////////////////////////////

