matt-garman/pic10f320-bypass-firmware/bypass_mcu_pic10f320.c
static debounce_context_t ctx_;



//////////////////////////////////////////////////////////////////////////////
// INIT + MAIN
//////////////////////////////////////////////////////////////////////////////

// high-level initialization
// called at power-on, and after a reset (e.g. brown-out or watchdog timeout)
static void init(void) {

    // Pet the WDT first thing, mirroring the AVR shell's "re-arm first".
    // Unlike the AVR -- whose WDTCR collapses to the ~16ms minimum after a
    // WDRF, creating a short post-reset reset-loop hazard -- the PIC has no
    // such window: WDTE=ON runs the WDT from reset at its ~2s POR-default
    // prescale (1:65536 on the 31kHz LFINTOSC; confirm WDTCON's reset value
    // in DS40001585), which dwarfs init() + the <=12ms bypass pulse.  init()
    // narrows the period to ~256ms afterward (WDTPS=0x08).  This early pet is
    // therefore belt-and-suspenders, not required -- it documents why no
    // early arming is needed and costs one instruction.

    CLRWDT(); // reset the WDT countdown ("pet the dog")


    // configure exactly the pins in output_mask as outputs (TRISA bit = 0); all
    // other pins are left as inputs (TRISA bit = 1).  The selected pins are made
    // digital (ANSELA bit = 0) and driven low (LATA bit = 0).  RA3 is input-only and
    // always remains an input (its TRISA bit reads 1).
    LATA   &= (uint8_t)~BYPASS_OUTPUT_DDR_MASK;                     // selected pins -> low
    TRISA   = (uint8_t)((uint8_t)~BYPASS_OUTPUT_DDR_MASK & 0x0FU);  // mask pins = output, rest = input



    // core MCU bring-up: 2MHz HFINTOSC, all-digital port, the footswitch weak
    // pull-up, the global weak-pull-up enable, and the ~256ms watchdog period.
    // Does NOT start the tick timer (see below).
    //
    // Ordering: call AFTER output pins are configured (above) so the
    // ANSELA/pull-up writes here do not disturb the output-pin direction
    // setup.
    //
    // HFINTOSC = 2 MHz (IRCF = 0b100).  Must match _XTAL_FREQ (asserted
    // below), which the relay/mute drivers' __delay_ms() relies on.
    OSCCONbits.IRCF = HFINTOSC_2MHZ_IRCF;

    // entire port digital -- the I/O pins power up as analog inputs.
    ANSELA = 0x00U;

    // enable the footswitch (RA3) input pull-up
    // FOOTSW_PIN high = released; low = pressed
    // belt-and-suspenders alongside any external pull-up
    WPUA  |= (uint8_t)(1U << FOOTSW_PIN);
    OPTION_REGbits.nWPUEN = 0; // enable weak pull-ups globally (active-low)

    // ~256ms (WDTPS = 0b01000 = 1:8192 on the ~31kHz LFINTOSC), mirroring the
    // AVR shell's 250ms.  The LFINTOSC has ±25% tolerance (datasheet OS09)
    // and the WDT period is characterized at -37%/+69% (param 31), so
    // worst-case it is still ~160ms -- comfortably > the ~13ms worst-case
    // pet-to-pet window (1ms tick + 12ms relay coil pulse), unlike the prior
    // 32ms (~1.4x margin).
    WDTCONbits.WDTPS = WDT_WDTPS_256MS;



    // default to bypass (may block on the relay/mute pulse, which is shorter
    // than one WDT period)
    // note, the 4053-with-mute and relay variants use __delay_ms(): so it's
    // important that this is invoked AFTER the OSCCONbits.IRCF setting above
    hw_set_bypass_state();

    // initialize global switch state from the current footswitch level
    // typical startup case: assume switch is not pressed
    ctx_.program_state    = PRESS_DEBOUNCE_WAIT;
    ctx_.effect_state     = BYPASS;
    ctx_.debounce_counter = 0U;

    // special case: footswitch pressed during power-on: keep in bypass state,
    // but use timer + footswitch polling to wait for release
    if (PIN_STATE_LOW == hw_read_footswitch()) {
        ctx_.program_state = RELEASE_DEBOUNCE_WAIT;
        ctx_.debounce_counter = RELEASE_THRESH;
    }



    // LAST: start + clear the tick, immediately before the loop, so no
    // compare match accumulated during init is mistaken for the first real
    // tick.
    //
    // configure + start the 1ms tick on TMR2, polled (no interrupt).  At
    // FOSC=2MHz the timer clock is FOSC/4 = 500kHz; the 1:4 PREscaler
    // (T2CKPS) -> 125kHz, and  │ PR2=124 -> (124+1) = 125 counts = 1ms
    // period.  The output POSTscaler (T2OUTPS) is set to 1:1, so TMR2IF
    // asserts on every PR2 match (once per 1ms), not once per N matches.
    // MUST run AFTER any blocking output actuation so a TMR2IF that set
    // during init is not mistaken for the first real tick.
    PR2   = TMR2_PR2_PERIOD;   // 1ms period
    T2CON = TMR2_T2CON_CONFIG; // T2CKPS = 0b01 (1:4 prescale), TMR2ON = 1
    PIR1bits.TMR2IF = 0;       // start clean
}


// program entry point: a single polled 1ms loop.
// Each tick we sample + integrate the footswitch and advance the debounce
// state machine; CLRWDT at the end of every iteration is the main-loop
// liveness proof.
void main(void) {

    init(); // note: initializes ctx_

    for (;;) {

        // pause until the next 1ms tick, then clear the flag; the PIC polls
        // TMR2IF (no sleep)
        while (0U == PIR1bits.TMR2IF) { }
        PIR1bits.TMR2IF = 0;



        // basic sanity checks against outlier events (cosmic rays, extreme
        // EMI); always checked, regardless of state; force a WDT reset on any
        // violation.
        // main-loop liveness is proven by reaching CLRWDT() below.
        if ( (ctx_.program_state > RELEASE_DEBOUNCE_WAIT) ||
                (ctx_.effect_state > ENGAGED) ||
                (ctx_.debounce_counter > RELEASE_THRESH) ||
                // assert footswitch pull-up still enabled
                (0U == hw_footswitch_pullup_intact()) ||
                // assert the critical config SFRs still hold their init() values
                // (2MHz clock, ~256ms WDT period, 1ms tick timer, all-digital
                // output pins) -- see hw_critical_sfrs_intact()
                (0U == hw_critical_sfrs_intact()) ||
                // config-specific runtime sanity checks
                hw_is_sanity_check_failed()
           ) {
            hw_force_wdt_reset();
        }



        // inline version of parent project's pure debounce_integrate()
        //
        // sample + integrate this tick (in the main loop, not an ISR)
        //
        // saturating integrator update:
        //   footswitch pin zero (low) == switch closed
        //   footswitch pin one (high) == switch open
        if (PIN_STATE_LOW == hw_read_footswitch()) { // switch closed
            if (ctx_.debounce_counter < RELEASE_THRESH) { ++ctx_.debounce_counter; }
        }
        else { // footswitch pin is high -> switch open
            if (ctx_.debounce_counter > 0U) { --ctx_.debounce_counter; }
        }




        // inline version of parent project's pure debounce_step()
        //
        // advance the debounce state machine
        switch (ctx_.program_state) {

            // waiting for the footswitch to be press-debounced
            case PRESS_DEBOUNCE_WAIT:
                {
                    // check for press-debounced condition
                    if (ctx_.debounce_counter >= PRESSED_THRESH) {
                        ctx_.debounce_counter = RELEASE_THRESH;
                        ctx_.program_state = RELEASE_DEBOUNCE_WAIT;
                        if (BYPASS == ctx_.effect_state) {
                            ctx_.effect_state = ENGAGED;
                            hw_set_engaged_state();
                        }
                        else { // ENGAGED == ctx_.effect_state
                            ctx_.effect_state = BYPASS;
                            hw_set_bypass_state();
                        }
                    }
                }
                break;

            // waiting for the footswitch to be release-debounced
            // note: holding the switch closed, or mechanical
            //       failure (e.g. switch welded shut) causes this
            //       state to exist indefinitely: this is the design
            //       intent (software is "helpless", need physical
            //       human resolution)
            case RELEASE_DEBOUNCE_WAIT:
                {
                    if (0U == ctx_.debounce_counter) {
                        ctx_.program_state = PRESS_DEBOUNCE_WAIT;
                    }
                }
                break;

            // technically impossible to reach (sanity checks above would
            // catch this); but left for defense-in-depth/belt-and-suspenders
            // idiom of the overall project
            default:
                hw_force_wdt_reset();
                break;
        }


        // completing the loop body proves main() is alive
        CLRWDT(); // reset the WDT countdown ("pet the dog")
    }
}

